In [1]:
import yaml
from google.cloud import bigquery

In [2]:
config = yaml.load(open("credentials.yml"), yaml.Loader)
client = bigquery.Client.from_service_account_json(config["credentials_path"])

In [3]:
dataset_ref = bigquery.DatasetReference("bigquery-public-data", "nhtsa_traffic_fatalities")
table_ref = bigquery.TableReference(dataset_ref, "accident_2015")

table = client.get_table(table_ref)
client.list_rows(table, max_results=5).to_dataframe()

,state_number,state_name,consecutive_number,number_of_vehicle_forms_submitted_all,number_of_motor_vehicles_in_transport_mvit,number_of_parked_working_vehicles,number_of_forms_submitted_for_persons_not_in_motor_vehicles,number_of_persons_not_in_motor_vehicles_in_transport_mvit,number_of_persons_in_motor_vehicles_in_transport_mvit,number_of_forms_submitted_for_persons_in_motor_vehicles,...,minute_of_ems_arrival_at_hospital,related_factors_crash_level_1,related_factors_crash_level_1_name,related_factors_crash_level_2,related_factors_crash_level_2_name,related_factors_crash_level_3,related_factors_crash_level_3_name,number_of_fatalities,number_of_drunk_drivers,timestamp_of_crash
0,30,Montana,300019,5,5,0,0,0,7,7,...,45,0,None,0,None,0,None,1,0,2015-03-28 14:58:00+00:00
1,39,Ohio,390099,7,7,0,0,0,15,15,...,24,27,Backup Due to Prior Crash,0,None,0,None,1,0,2015-02-14 11:19:00+00:00
2,49,Utah,490123,16,16,0,0,0,28,28,...,99,0,None,0,None,0,None,1,0,2015-04-14 12:24:00+00:00
3,48,Texas,481184,6,5,1,0,5,5,10,...,99,0,None,0,None,0,None,1,0,2015-05-27 16:40:00+00:00
4,41,Oregon,410333,11,11,0,0,0,14,14,...,99,0,None,0,None,0,None,1,0,2015-11-17 18:17:00+00:00

In [6]:
# Determine how the number of accidents varies with the day of the week.
query = """
    SELECT COUNT(consecutive_number) AS num_accidents, EXTRACT(DAYOFWEEK FROM timestamp_of_crash) AS day_of_week
    FROM `bigquery-public-data.nhtsa_traffic_fatalities.accident_2015`
    GROUP BY day_of_week
    ORDER BY num_accidents DESC
"""

safe_config = bigquery.QueryJobConfig(maximum_bytes_billed=10**9)  # 1 GB
query_job = client.query(query, job_config=safe_config)
query_results = query_job.to_dataframe()
query_results

   num_accidents  day_of_week
0           5659            7
1           5298            1
2           4916            6
3           4460            5
4           4182            4
5           4038            2
6           3985            3

In [7]:
dataset_ref = bigquery.DatasetReference("bigquery-public-data", "world_bank_intl_education")
table_ref = bigquery.TableReference(dataset_ref, "international_education")

table = client.get_table(table_ref)
client.list_rows(table, max_results=5).to_dataframe()

,country_name,country_code,indicator_name,indicator_code,value,year
0,Chad,TCD,"Enrolment in lower secondary education, both s...",UIS.E.2,321921.0,2012
1,Chad,TCD,"Enrolment in upper secondary education, both s...",UIS.E.3,68809.0,2006
2,Chad,TCD,"Enrolment in upper secondary education, both s...",UIS.E.3,30551.0,1999
3,Chad,TCD,"Enrolment in upper secondary education, both s...",UIS.E.3,79784.0,2007
4,Chad,TCD,"Repeaters in primary education, all grades, bo...",UIS.R.1,282699.0,2006

In [11]:
# Which countries spend the largest fraction of GDP on education?
# To answer this question, consider only the rows in the dataset corresponding to indicator code `SE.XPD.TOTL.GD.ZS`,
# and write a query that returns the average value in the `value` column for each country in the dataset between the
# years 2010-2017 (including 2010 and 2017 in the average).

query = """
    SELECT country_name, AVG(value) AS avg_ed_spending_pct
    FROM `bigquery-public-data.world_bank_intl_education.international_education`
    WHERE indicator_code = 'SE.XPD.TOTL.GD.ZS' AND year >= 2010 AND year <= 2017
    GROUP BY country_name
    ORDER BY avg_ed_spending_pct DESC
"""

safe_config = bigquery.QueryJobConfig(maximum_bytes_billed=10**9)  # 1 GB
query_job = client.query(query, job_config=safe_config)
query_results = query_job.to_dataframe()
query_results

                 country_name  avg_ed_spending_pct
0                        Cuba            12.837270
1       Micronesia, Fed. Sts.            12.467750
2             Solomon Islands            10.001080
3                     Moldova             8.372153
4                     Namibia             8.349610
..                        ...                  ...
152                  Cambodia             1.706404
153        West Bank and Gaza             1.503760
154               South Sudan             1.409726
155                    Monaco             1.409606
156  Central African Republic             1.214010

[157 rows x 2 columns]

In [15]:
# Write a query below that selects the indicator code and indicator name for all codes with at least 175 rows in the year 2016.

query = """
    SELECT indicator_code, indicator_name, COUNT(1) AS num_rows
    FROM `bigquery-public-data.world_bank_intl_education.international_education`
    WHERE year = 2016
    GROUP BY indicator_code, indicator_name
    HAVING num_rows >= 175
    ORDER BY num_rows DESC
"""

safe_config = bigquery.QueryJobConfig(maximum_bytes_billed=10**9)  # 1 GB
query_job = client.query(query, job_config=safe_config)
query_results = query_job.to_dataframe()
query_results

,indicator_code,indicator_name,num_rows
0,SP.POP.TOTL,"Population, total",232
1,SP.POP.GROW,Population growth (annual %),232
2,IT.NET.USER.P2,Internet users (per 100 people),223
3,SP.POP.1564.TO,"Population, ages 15-64, total",213
4,SP.POP.1564.FE.IN,"Population, ages 15-64, female",213
5,SP.POP.0014.FE.IN,"Population, ages 0-14, female",213
6,SP.POP.1564.TO.ZS,"Population, ages 15-64 (% of total)",213
7,SP.POP.0014.MA.IN,"Population, ages 0-14, male",213
8,SP.POP.TOTL.FE.ZS,"Population, female (% of total)",213
9,SP.POP.0014.TO,"Population, ages 0-14, total",213
10,SP.POP.0014.TO.ZS,"Population, ages 0-14 (% of total)",213
11,SP.POP.1564.MA.IN,"Population, ages 15-64, male",213
12,SP.POP.TOTL.MA.ZS,"Population, male (% of total)",213
13,SP.POP.TOTL.MA.IN,"Population, male",213
14,SP.POP.TOTL.FE.IN,"Population, female",213
15,SH.DYN.MORT,"Mortality rate, under-5 (per 1,000)",213
16,NY.GDP.PCAP.CD,GDP per capita (current US$),211
17,NY.GDP.MKTP.CD,GDP at market prices (current US$),211
18,SL.UEM.TOTL.ZS,"Unemployment, total (% of total labor force)",208
19,SL.UEM.TOTL.FE.ZS,"Unemployment, female (% of female labor force)",208
20,NY.GDP.PCAP.KD,GDP per capita (constant 2005 US$),208
21,SL.UEM.TOTL.MA.ZS,"Unemployment, male (% of male labor force)",208
22,NY.GDP.MKTP.KD,GDP at market prices (constant 2005 US$),208
23,SL.TLF.TOTL.IN,"Labor force, total",207
24,SL.TLF.TOTL.FE.ZS,"Labor force, female (% of total labor force)",207
25,NY.GDP.PCAP.PP.KD,"GDP per capita, PPP (constant 2011 internation...",203
26,NY.GDP.PCAP.PP.CD,"GDP per capita, PPP (current international $)",203
27,UIS.THAGE.0,Official entrance age to pre-primary education...,203
28,NY.GDP.MKTP.PP.CD,"GDP, PPP (current international $)",203
29,NY.GDP.MKTP.PP.KD,"GDP, PPP (constant 2011 international $)",203
30,UIS.THAGE.3.A.GPV,Official entrance age to upper secondary educa...,203
31,NY.GNP.MKTP.CD,GNI (current US$),202
32,NY.GNP.PCAP.CD,"GNI per capita, Atlas method (current US$)",200
33,NY.GNP.MKTP.PP.CD,"GNI, PPP (current international $)",199
34,NY.GNP.PCAP.PP.CD,"GNI per capita, PPP (current international $)",199
35,SE.COM.DURS,Duration of compulsory education (years),193
36,UIS.SAP.23.GPV.G1,Population of the official entrance age to sec...,187
37,UIS.SAP.23.GPV.G1.F,Population of the official entrance age to sec...,186
38,UIS.SAP.23.GPV.G1.M,Population of the official entrance age to sec...,186
39,UIS.SAP.1.G1,Population of the official entrance age to pri...,185
40,UIS.SAP.1.G1.F,Population of the official entrance age to pri...,184
41,UIS.SAP.1.G1.M,Population of the official entrance age to pri...,184
42,SE.PRM.AGES,Official entrance age to primary education (ye...,178
43,SE.PRM.DURS,Theoretical duration of primary education (years),178
44,SE.SEC.AGES,Official entrance age to lower secondary educa...,175
45,UIS.THDUR.0,Theoretical duration of pre-primary education ...,175
46,SE.SEC.DURS.UP,Theoretical duration of upper secondary educat...,175
47,SE.SEC.DURS.LO,Theoretical duration of lower secondary educat...,175
48,SE.SEC.DURS,Theoretical duration of secondary education (y...,175